
import sys
sys.stdin = open("input.txt", "r")

T = int(input())
# 여러개의 테스트 케이스가 주어지므로, 각각을 처리합니다.
for test_case in range(1, T + 1):
    # ///////////////////////////////////////////////////////////////////////////////////

    N = int(input())                        # N 크기 달팽이

    space = [[0] * N for _ in range(N)]

    dx = [0, 1, 0, -1]                        # 행이동
    dy = [1, 0,-1, 0]                         # 열이동
    move = list(zip(dx, dy))                  # [오른쪽/ 아래/ 왼쪽/ 위] 이동 방향
    # [(0, 1), (1, 0), (0, -1), (-1, 0)]

    i = 1                                     # 1부터 넣기
    while i == N * N:
    



    # ///////////////////////////////////////////////////////////////////////////////////
